package main

import (
    "fmt"
)

func main() {
    var num int
    num = 1
    fmt.Println(num)

}
// go build Lesson06_01.go
// ./Lesson06_01

// go run Lesson06_01.go



株式会社BOEL

社会へのささやかな貢献   田澤 鉄平

東急東横線「学芸大学駅」西口より徒歩6分

デザイン・ブランディングを通じてコミュニケーションをきもちよさ・ここちよさから考える

若手が育ちやすい
カスタマーファースト
創造性と革新性

CSS・HTML・JavaScript・PHP

ecサイト ブランディング


ハコダテエアポート   函館空港のホームページ

トマムウェディング   家族のウェディングリゾート

ジブンハウス        家族がもっと家族になれる家つくり

ユサンディ      沖縄の石垣島でオールスイートプライベートリゾート JUSANDI（ユサンディ）￥

アユムホーム     共に歩む家つくり、群馬で他にない新しいハウスメーカー

マイホームマーケット   新しい家の買い方 売り方をつくる

Shopify        専門知識が無くても、企業や個人が独自ブランドのECサイトを構築し、国内外へのオンライン販売を手軽に始められる「Shopify」
ショッピファイ    カナダのオタワに拠点を置くShopify社が運営するeコマース用のプラットフォーム

株式会社アスノオト   都市と地方を経済という一つの軸で見るのではなく、日本全体として都市と地方の良い連携・関係を形成する

CAREERSCAREERSMENU
PROJECTS
WHAT WE DO
WHO WE ARE
TIPS
CAREERS
CONTACT
NEWS
PRIVACY POLICY
SOCIAL MEDIA POLICY
SECURITY POLICY
TERMS OF USE
SITEMAP
株式会社BOEL公式ツイッター | 株式会社BOEL株式会社BOEL公式ツイッター | 株式会社BOEL
株式会社BOEL公式フェイスブック | 株式会社BOEL株式会社BOEL公式フェイスブック | 株式会社BOEL
株式会社BOEL公式インスタグラム | 株式会社BOEL株式会社BOEL公式インスタグラム | 株式会社BOEL
エンジニア
ENGINEER
新卒・既卒可
中途可
学歴不問
Webサイトをはじめとするインタラクティブコンテンツの開発や、Python、PHP、JavaScriptフレームワークを使ったWebアプリケーション開発（フロントエンド）、サーバーサイドのプログラミング（バックエンド）などを担当していただきます。サービスの新しい機能やリリース済みの機能の改善にかかわるWebアプリケーションの開発および運用を行います。また、自社の新規事業開発も現在進行しています。プロジェクトメンバーとしてぜひ参加して頂きたいと思っています。
近年WEBアプリケーションは急速に発展しており、要求レベル、スピード、そして高い品質が求められています。要件が複雑化する中で、技術の習得が不可欠です。そして、デザイナーやディレクターとの密なやり取りがプロジェクトを前進させます。相手を思いやり、想像力を働かせてコミュニケーションの取れる方をお待ちしています。

VALUE
わたしたちが大切にする価値
以下は、BOEL Inc.で働く私たちがどんな行動やスキルを重視しているかをまとめています。わたしたちが何を大切にしているかは、どんな人が評価され、どんな人が会社を去るかで示されます。あなたに当てはまる価値や資質が、一緒に働きたい人の理想像に近いほど、BOEL Inc.はあなたの活躍の場として適しています。

誠実さ
・正直かつ中立的で、誠意と透明性のある人だと周りから慕われる
・パートナー、仲間と、チームワークを尊重して行動する
・自分の間違いを素直に認められる
・意見の相違や相手の立場に関係なく、人には敬意をもって接する
・たとえためらわれる状況であっても、共有すべき情報は共有する

献身的な姿勢
・大切な仲間をサポートするために時間を割ける
・周囲と壁を作らず、情報やナレッジをオープンかつ積極的に共有できる
・自分にとっての最良ではなく、BOEL Inc.にとっての最良を求められる

情熱
・飽くなき向上心で周囲の士気を高められる
・チーム、ひとりひとりのメンバーのことを大事に考え、BOELのビジネスの成功に注力できる
・いつも前向きに粘り強く取り組み続けることができる
・自信を持ちながらもひけらかさず、謙虚な姿勢を見せられる

コミュニケーション
・人の話をよく聞き、きちんと理解してから応じられる
・ストレスの多い状況でも平静を保ち、明晰に考えられる
・率直かつ有益なフィードバックを、平易な言葉でていねいに仲間に伝えられる


仕事内容
・フロントエンド、バックエンドを問わず、最新技術を取り入れた自社サービス、クライアント向けのWebサイトやアプリケーションの開発・運用。
・プロダクトのビジョン、戦略、目標、ロードマップの策定
・開発に必要なメンバー、体制の提案・構築
・フロントエンド：TypeScript、React.js、Next.js、Vue.js、Nuxt.js、webpackを活用したサーバサイドの開発
・バックエンド：Node.js、Ruby、Ruby on Rails、PHP、Laravel、SQLを活用したサーバサイドの開発
・Webアプリケーション、ブランドサイト・ECサイトの運用・保守

ABILITY
求められるスキル
・既存の技術だけに拘らず、より最適な方式で改善・解決する姿勢
・サイト設計やHTML5、CSS3を用いたコーディングスキル
・Node.js/vue.jsなどのJavaScriptフレームワークを利用した開発スキル
・社内防衛だけではなく外部セキュリティサービスなどを適宜利用するための情報収集力
・一緒に働く仲間をリスペクトできるチームワーク

EXPERIENCE
歓迎する経験
・システム全般の基本スキル
・Webアプリケーション開発経験(2年以上)
・Git を用いた小規模チーム（2～5人）での開発経験
・サイト設計やHTML5、CSS3を用いたコーディングスキル
・Node.js/vue.jsなどのJavaScriptフレームワークを利用したコンテンツ開発経験
・PHPフレームワークの実装経験